Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_2.tmx
Source language: de
Languages: en

source: Filter als Teile von Motoren
en: Filters being parts of machines

source: Schaltgetriebe für Hydraulikantriebe [ausgenommen für Landfahrzeuge]
en: Gear boxes for hydraulic transmissions [other than for land vehicles]

source: Maschinen zum Formen
en: Machines for shaping

source: Schlitzmaschinen [zur Metallbearbeitung]
en: Slotting machines [for metalworking]

source: Bedampfungsmaschinen [zur Textilbehandlung]
en: Spray damping machines [for textile treatment]

source: Waschmaschinen für Textilien [für gewerbliche Zwecke]
en: Textile washing machines [for industrial purposes]

source: Gewindefräsen [Werkzeugmaschinen]
en: Thread milling cutters [machine tool]

source: Papierpressen [Maschinen], ausgenommen für Bürozwecke
en: Paper presses [machines], other than for office use

source: Staubsauger für gewerbliche und industrielle Zwecke
en: Commercial and industrial vacuum cleaners

source: Rasenbelüfter [Maschine]
en: Lawn raking machines

source: Füllstandsregelventile [Maschinenteile]
en: Level regulating valves [parts of machines]

source: Elektrische Obstschäler
en: Electric fruit peelers

source: Elektrische Messer und Messerschärfer
en: Electric knives and knife sharpeners

source: Gehäuse für Maschinen und Motoren
en: Crankcases for machines, motors and engines

source: Kraftventile für Vergaser [Fahrzeugteile]
en: Power valve for carburetors [vehicle parts]

source: Vibrationssiebabscheider [Maschinen]
en: Vibratory screen separators [machines]

source: Sämaschinen [für die Landwirtschaft]
en: Seed drills [agricultural implements]

source: Sprühgeräte zum Auftragen von Farbe
en: Air brushes for applying paint

source: Baumausschneider [Maschinen]
en: Tree pruners [machines]

source: Strickmaschinen
en: Knitting machines

source: Hydraulische Pressen [zur Metallbearbeitung]
en: Hydraulic presses [for metalworking]

source: Mechanisch betätigte Verschlüsse für Erdgasbohrlöcher
en: Mechanically operated stoppers for use in gas well applications

source: Federbuchsen [Maschinenteile]
en: Spring bushes [parts of machines]

source: Gehäuseringe [Maschinenteile]
en: Casing rings [parts of machines]

source: Feuchtwerke für Offset-Druckmaschinen
en: Dampening units for offset presses

source: Abbruchhämmer [Maschinen]
en: Demolition hammers [machines]

source: Schaufelräder
en: Bucket wheels

source: Rotierende Werkzeugeinsätze [Maschinenteile]
en: Rotary tool bits [parts of machines]

source: Siebe zur Trennung von Erz [Maschinenteile]
en: Screens for separating ore [parts of machines]

source: Vakuumschredder zur Beseitigung von Abfällen
en: Vacuum shredders for clearing debris

source: Vibratoren [Maschinen] für industrielle Zwecke
en: Vibrators [machines] for industrial use

source: Schleifmaschinen [zur Holzbearbeitung]
en: Sanding machines [for woodworking]

source: Servomotoren
en: Servomotors

source: Ansaugkrümmer für Kraftfahrzeuge
en: Automotive intake manifolds

source: Bohrkronen [Maschinenteile]
en: Drilling bits [parts of machines]

source: Kräne zum Einsatz auf Abschleppfahrzeugen
en: Cranes for use on breakdown vehicles

source: Geschirre für Webstühle
en: Gears for weaving looms

source: Präzisionswerkzeugmaschinen zum Schneiden von Werkstücken
en: Precision machine tools for cutting workpieces

source: Präzisionsdrehwerkzeuge [Maschinen]
en: Precision turning tools [machines]

source: Abscheidezylinder [Maschinen]
en: Separating cylinders [machines]

source: Elektrische Scherenschärfer
en: Electric scissor sharpeners

source: Turbolader für Maschinen
en: Turbochargers for machines

source: Ventile für Pumpen
en: Valves for pumps

source: Ölhydraulikpressen [zur Metallbearbeitung]
en: Oil hydraulic presses [for metalworking]

source: Elektrisch betriebene Bürsten [Maschinenteile]
en: Brushes, electrically operated [parts of machines]

source: Statoren [Maschinenteile]
en: Stators [parts of machines]

source: Kreiselpumpen für Kondensatoreinheiten
en: Centrifugal pumps for condensing units

source: Strehler [Maschinen oder Maschinenteile]
en: Chasers [machines or parts for machines]

source: Rückschlagventile, nicht aus Metall [Maschinenteile]
en: Check valves (non-metallic -) [parts of machines]

source: Bohrer für Leiterplatten [Maschinen oder Werkzeugmaschinen]
en: Circuit board drills [machines or machine tools]

source: Schleifinstrumente [Maschinen]
en: Abrasive instruments [machines]

source: Schleifwerkzeuge als Maschinenteile
en: Abrasive tools being parts of machines

source: Kombinierte Drahtabisolierer und -schneider [Maschinen]
en: Combined wire strippers and cutters [machines]

source: Geschirrgestelle als Teile von Geschirrspülmaschinen
en: Dishwasher racks being parts of a dishwasher

source: Melkanlagen zur automatischen Milchgewinnung
en: Milking installations for automatic milk extraction

source: Kohlebürsten für elektrische Maschinen
en: Carbon brushes for electrical machines

source: Kohlebürsten für Anlassermotoren
en: Carbon brushes for starter motors

source: Elektrische Handbohrmaschinen
en: Upward continuous casting machines

source: Schleifwerkzeuge für Schleifmaschinen
en: Grinding tools for grinding machines

source: Elektrische Bohnergeräte für den Haushalt
en: Electric wax-polishing machines for household purposes

source: Waschtrommeln [Maschinen]
en: Washing drums [machines]

source: Spülmaschinen für Töpfe
en: Washing machines for pots

source: Abfallkonverter [Maschinen]
en: Waste converters [machines]

source: Schrägverzahnte Zahnräder für industrielle Zwecke
en: Helical gear units for industrial purposes

source: Hydraulikkreisläufe für Maschinen
en: Hydraulic circuits for machines

source: Hydraulikventile [Maschinenteile]
en: Hydraulic valves [parts of machines]

source: Mitnehmer [Maschinenteile]
en: Feeders [parts of machines]

source: Elektrische Küchenwerkzeuge
en: Electric kitchen tools

source: Schleudermühlen für chemische Verfahren
en: Disintegrators [for chemical processing]

source: Zahnräder für Antriebsketten
en: Toothed wheels for driving chains

source: Digitale elektro-hydraulische Dosierventile
en: Digital electro-hydraulic proportioning valves

source: Bürsten für Gleichstromgeneratoren [Maschinenteile]
en: Direct current generator brushes [parts of machines]

source: Schläuche, nicht aus Metall, zur Übertragung von hydraulischem Druck in Maschinen
en: Hoses (Non-metallic -) for transferring hydraulic power in machines

source: Schweißbrenner
en: Welding torches

source: Selbstschmierende Lager für Motoren von Raumfahrzeugen
en: Self-lubricating bearings for use in aerospace engines

source: Rollen für Rotationsdruckmaschinen
en: Rollers for rotary printing machines

source: Treibriemen zur Übertragung von Antriebsbewegung auf Landfahrzeuge
en: Belts (Driving -) for transmitting motion to land vehicles

source: Standardbohrmaschinen mit numerischer Positionierung
en: Numerically positioned standard drilling machines

source: Stationäre Kreissägen [Maschinen]
en: Stationary circular saws [machines]

source: Bohreinsätze für Maschinen
en: Drill bits for machines

source: Bohrständer für Bohrmaschinen
en: Drill stands for drilling machines

source: Bohranlagen für Bohrungen an Land
en: Drilling rigs for drilling wells on land

source: Industrieroboter für die Montage von zu bearbeitenden Werkstücken
en: Industrial robots for use in the mounting of workpieces to be worked on

source: Saugreinigungsmaschinen zur Verwendung in der Fertigung
en: Suction cleaning machines for use in manufacture

source: Sauggebläse zum Einsaugen von Körnern
en: Suction fans for the sucking of grain

source: Kugelgelenke für Federungen [Maschinenteile]
en: Suspension ball joints [parts of machines]

source: Elektrische Schuhputzmaschinen [zum Polieren]
en: Electric shoe cleaning [polishing] machines

source: Elektrische Dampfreinigungsmaschinen
en: Electric steam cleaning machines

source: Elektrische Bremsen für Maschinen
en: Electrical brakes for machines

source: Sprühventile [Maschinenteile]
en: Spray valves [parts of machines]

source: Spritzgeräte [Maschinen] für Gartenbauzwecke
en: Sprayers [machines] for use in horticulture

source: Förderbänder aus Metall
en: Conveyor belts of metal

source: Senkwerkzeuge als Maschinenwerkzeuge
en: Countersinking tools for machines

source: Spinnmaschinen für Chemiefasern
en: Chemical fiber spinning machines

source: Volumetrische Drehgetriebepumpen
en: Volumetric rotating gear pumps

source: Elektrische Heißluftpistolen
en: Hot air guns [electric]

source: Spulenadapter [Teile von Industriemaschinen]
en: Spool adaptors [parts for industrial machine]

source: Heckantriebe für Schiffe
en: Stern drives for ships

source: Gesteinsbrecher [Maschinen]
en: Stone crushers [machines]

source: Elektrische Geradkantenhobel [Maschinen]
en: Straight edge tools [electrically operated]

source: Automatisierte Montagemaschinen
en: Automated assembly machines

source: Niethämmer [Elektrowerkzeuge]
en: Riveting hammers [powered tools]

source: Greifer für Kräne
en: Grippers for cranes

source: Abfallpressen für gewerbliche Zwecke
en: Industrial trash compacting machines

source: Kolbenringe [Teile von Verbrennungsmotoren]
en: Piston rings [internal combustion engine parts]

source: Verbrennungsmotoren für Boote und Schiffe
en: Internal combustion engines for boats

source: Schlagwerkzeugsätze für Maschinen
en: Percussion tool bits for machines

source: Pfahlrammen [Maschinen]
en: Pile drivers [machines]

source: Zieheisen für Ziehbänke
en: Drawplates for drawbenches

source: Maschinenwerkzeuge zum Ausrichten von Bohrern
en: Drill aligning instruments being machines

source: Pneumatische Steuerungseinrichtungen
en: System control instruments (Pneumatic -)

source: Stampfwalzen [Maschinen]
en: Tamping rollers [machines]

source: Klebemaschinen [zum Binden, ausgenommen für Bürozwecke]
en: Taping [tying] machines other than for office use

source: Elektrische Gartenwerkzeuge
en: Gardening tools (Electric -)

source: Überlastkupplungen [Maschinenteile]
en: Overload couplings [parts of machines]

source: Fahrerlose Transportfördergeräte als Maschinen für den Frachtumschlag
en: Unmanned transportation conveyors being cargo handling machines

source: Elektrische Schneidemaschinen für die industrielle Lebensmittelverarbeitung
en: Slicing machines (Electric -) for large scale food processing

source: Stichsägen
en: Jig saws

source: Fahrbare Kräne
en: Locomotive cranes

source: Schleifblätter, alle als Teile von Maschinen oder Elektrowerkzeugen
en: Abrasive sheets all being parts of machines or power tools

source: Elektrische Entsafter für Obst und Gemüse
en: Electrical squeezers for fruit and vegetable

source: Kraft- und Treibstoffzapfsäulen für Tankstellen
en: Fuel dispensing pumps for service stations

source: Wechselstrommotoren für Luftfahrzeuge
en: Alternating current motors for airborne vehicles

source: An Fahrzeugen zu montierende Sprühbalken zum Besprühen von Feldfrüchten
en: Spraying booms for attachment to vehicles for the purpose of spraying crops

source: Gewindeschneider [Maschinen]
en: Screw-thread cutters [machines]

source: Abfüllmaschinen für Sprühdosen
en: Aerosol filling machines

source: Landwirtschaftliche Düngemaschinen
en: Agricultural machines for fertilising

source: Metallsägeblätter für Maschinen
en: Hacksaw blades for machines

source: Winden mit eingebauter Sperre
en: Winches incorporating a lock

source: Mühlsteine
en: Millstones

source: Kraftbetriebene Rasen- und Gartenkultivatoren
en: Power-operated lawn and garden tillers

source: Luftkompressoren für Fahrzeuge
en: Air compressors for vehicles

source: Bohrwerkzeuge für Maschinen
en: Drilling tools for use with machines

source: Ölpumpen für Motoren und Maschinen
en: Oil pumps for use in motors and engines

source: Unterlagen für Fußbodenpoliermaschinen
en: Pads for floor polishing machines

source: Walzmaschinen [Straßenbaumaschinen]
en: Road rolling [vehicles] machines

source: Bodenreinigungsroboter [zum Staubsaugen]
en: Robotic cleaning [vacuuming] machines for floors

source: Bohrmaschinen zur Holzbearbeitung
en: Boring machines for use in woodworking

source: Bohrroboter für Reparaturen im Inneren von Kanalisationsrohren
en: Boring robots for repairing the interiors of canalization pipes

source: Bogensägen [Maschinen]
en: Bow saws [machines]

source: Lager und Buchsen [Maschinenteile]
en: Bearings and bushings [machine parts]

source: Strohwalzen [Maschinen]
en: Straw mills [machines]

source: Bandwickelmaschinen für Transformatorspulen
en: Strip coiling machines for transformer coils

source: Elektrische Häcksler
en: Electric chaff-cutters

source: Blätter für Kreissägen [Maschinen]
en: Blades for circular saws [machines]

source: Winden für Elektrokabel
en: Electric cable hoists

source: Filzriemen als Maschinenteile zur Verwendung bei Abschleifarbeiten
en: Non-woven belts being parts of machines for use in abrading

source: Baumscheren [ausgenommen handbetätigt]
en: Pruning shears [other than hand operated]

source: Förderschnecken [Maschinen]
en: Spiral conveyors [machines]

source: Evolventenkerbverzahnungen [Maschinenteile]
en: Splines (involute -) [parts of machines]

source: Druckmasken [Maschinenteile]
en: Printing masks [parts of machines]

source: Sägeblätter [Maschinenteile]
en: Saw blades [parts of machines]

source: Getriebe für Maschinen
en: Gear units for machines

source: Elektrische Fleischermesser
en: Butchers' knives (Electric -)

source: Schalldämpfer [Teile von Auspuffanlagen]
en: Mufflers [parts of exhaust systems]

source: Schleifscheiben für Elektrowerkzeuge
en: Discs for abrading for use with power tools

source: Scheiben für Kupplungsdrucklager, ausgenommen für Landfahrzeuge
en: Discs for clutch thrust bearings, other than for land vehicles

source: Schleifmaschinen zum Kappen von Werkzeugen
en: Grinding machines for cutting tools

source: Ölabscheider [Maschinen]
en: Oil separators [machines]

source: Profilgießformen [Maschinenteile]
en: Moulding dies [parts of machines]

source: Kuvertier- und Einwickelmaschine [Verpackungsmaschine]
en: Envelope stuffing and inserting machines [packaging machines]

source: Spritzschutzklappen für Maschinen
en: Spray prevention flaps for machines

source: Druckentlastungsschrauben [Maschinenteile]
en: Pressure release screws being parts of machines

source: Werkzeuge [Maschinen] für Fliesenleger
en: Tilers' (tools for -) [machines]

source: Rotierende Fräsen [Maschinen]
en: Rotary milling cutters [machines]

source: Wasserversorgungsmaschinen [Pumpen]
en: Water supply machines [pumps]

source: Maschinen für die Metallverarbeitung
en: Machines for machining metals

source: Keilriemen für Landfahrzeugmotoren
en: Fan belts for land vehicle engines

source: Setzgeräte für Befestigungselemente [Maschinenteile]
en: Fastener setting tools [parts of machines]

source: Trommeln für Maschinen
en: Drums [parts of machines]

source: Lichtmaschinen für Landfahrzeuge
en: Generators for land vehicles

source: Antriebsräder für Abgasturbolader
en: Impellers for turbo-superchargers

source: Prägemaschinen für gewerbliche Zwecke
en: Imprinting machines for industrial purposes

source: Palettenwechselvorrichtungen für Werkzeugmaschinen
en: Pallet changing devices for machine tools

source: Sämaschinen zum Anhängen an Traktoren
en: Sowing machines for towing behind tractors

source: Werkzeugmaschinen zum Trennen
en: Machine tools for parting

source: Werkzeugmaschinen zum Sägen
en: Machine tools for sawing

source: Werkzeuge [Maschinenteile]
en: Tools [parts of machines]

source: Mutternschlüssel [Maschinen]
en: Nut spinners [machines]

source: Mutterndreher [Maschinen]
en: Socket spanners [machines]

source: Einsätze [Maschinenteile]
en: Sockets [parts for machines]

source: Fräsen [Werkzeugmaschinen]
en: Milling cutters [machine tool]

source: Mühlen [Maschinen]
en: Mills [machines]

source: Nibbler [Maschinen]
en: Nibblers [machines]

source: Gasbetriebene Schneidbrenner
en: Cutting blow pipes, gas-operated

source: Schweißbrenner [gasbetrieben]
en: Welding torches [gas-operated]

source: Elektrische Tranchiermesser
en: Electric carving knives

source: Maschinen zum Kleben
en: Splicing machines

source: Winden
en: Winches

source: Spulen für Maschinen
en: Reels [parts of machines]

source: Saugglocken [Maschinen]
en: Plungers [machines]

source: Werkzeugmaschinen zum Verpacken
en: Tools (Machine -) for use in packaging

source: Rohrentgrater [Maschinenwerkzeuge]
en: Tube reamers [tools for machines]

source: Typografische Maschinen
en: Typographic machines

source: Maschinen zum Drucken
en: Printshop machines

source: Nähmaschinen
en: Sewing machines

source: Maschinen zum Stanzen
en: Die-cutting machines

source: Automatische Dosiermaschinen
en: Automatic dispensing machines

source: Vergaser [Fahrzeugteile]
en: Carburetors [vehicle parts]

source: Maschinen und Werkzeugmaschinen für Materialbearbeitung und Produktion
en: Machines and machine tools for treatment of materials and for manufacturing

source: Umzugs- und Transportgeräte
en: Moving and handling equipment

source: Förderanlagen und Förderbänder
en: Conveyors and conveyors belts

source: Öffnungs- und Schließmechanismen
en: Opening and closing mechanisms

source: Hub- und Hebegeräte, Aufzüge und Rolltreppen
en: Lifting and hoisting equipment, elevators and escalators

source: Ausrüstung für das Bauwesen
en: Construction equipment

source: Materialfertigungs- und -bearbeitungsmaschinen
en: Material production and processing machines

source: Textil- und Ledernähausrüstung
en: Textile and leather sewing equipment

source: Druck- und Buchbindemaschinen
en: Printing and bookbinding machines

source: Maschinen zur Müllbeseitigung und -verwertung
en: Waste management and recycling machines

source: Filtermaschinen, Separatoren und Zentrifugen
en: Filtering machines, separators and centrifuges

source: Bügelmaschinen und Bügelpressen
en: Ironing machines and laundry presses

source: Elektrische Fensterschließer
en: Window closers, electric

source: Hydraulische Fensteröffner
en: Window openers, hydraulic

source: Hydraulische Fensterschließer
en: Window closers, hydraulic

source: Pneumatische Fensteröffner
en: Window openers, pneumatic

source: Pneumatische Fensterschließer
en: Window closers, pneumatic

source: 3D-Drucker
en: 3D printers

source: Gummimischrollen als Teile von Gummimischmaschinen
en: Rubber mixing rolls being parts of rubber mixing machines

source: Maschinen und Geräte zur Verhinderung von Braunfäule, ausgenommen handbetätigte Geräte
en: Blight prevention machines and implements, other than hand-operated implements

source: Düngemittelstreumaschinen und -geräte, ausgenommen handbetätigte Geräte
en: Fertilizer distributing machines and implements, other than hand-operated implements

source: Dampfmaschinenkessel zur Energieerzeugung, ausgenommen für Landfahrzeuge
en: Steam engine boilers for power generation, other than for land vehicles

source: Müll- und Abfalltrennmaschinen
en: Waste and trash separator machines

source: Elektrische Kaffeeaufschäumer
en: Electric coffee frothers

source: Kraftbetriebene Skischleifmaschinen
en: Power-operated ski sharpening machines

source: Zündkerzen, nicht für Landfahrzeuge
en: Sparking plugs not for land vehicles

source: Turboproptriebwerke [nicht für Landfahrzeuge]
en: Turboprop engines [not for land vehicles]

source: Seilscheiben aus Metall als Maschinenteile
en: Metal pulleys being parts of machines

source: Joysticks als Teile von Maschinen, ausgenommen für Spielgeräte
en: Joysticks being parts of machines, other than for game machines

source: Gummiraupenketten als Teile von Kettenlaufwerken von Be- und Entlademaschinen
en: Rubber tracks being parts of crawlers on loading-unloading machines and apparatus

source: Gummiraupenketten als Teile von Kettenlaufwerken von Bergbaumaschinen
en: Rubber tracks being parts of crawlers on mining machines

source: Gummiraupenketten als Teile von Kettenlaufwerken von Schneepflügen
en: Rubber tracks being parts of crawlers on snow ploughs

source: Eckventile als Maschinenteile
en: Angle valves being parts of machines

source: Kugelventile als Maschinenteile
en: Ball valves being parts of machines

source: Riemenscheiben als Maschinenteile
en: Belt pulleys being parts of machines

source: Schmetterlingsventile als Maschinenteile
en: Butterfly valves being parts of machines

source: Nockenscheiben als Maschinenteile
en: Cams being parts of machines

source: Kegelbremsen als Maschinenteile
en: Cone brakes being parts of machines

source: Flüssigkupplungen als Maschinenteile
en: Fluid couplings being parts of machines

source: Hydraulische Akkus als Maschinenteile
en: Hydraulic accumulators being parts of machines

source: Hydraulische Verstärker als Maschinenteile
en: Hydraulic intensifiers being parts of machines

source: Leerlaufscheiben als Maschinenteile
en: Idling pulleys being parts of machines

source: Beschichtete Blattfedern als Maschinenteile
en: Laminated leaf-springs being parts of machines

source: Rollenketten als Maschinenteile
en: Roller chains being parts of machines

source: Geschwindigkeitsänderungsgetriebe als Maschinenteile
en: Speed change gears being parts of machines

source: Antriebe für Luftfahrzeuge
en: Aviation drive trains

source: Mischmaschinen für chemische Verfahren
en: Blending machines for chemical processing

source: Entstaubungsmaschinen für chemische Verarbeitungsprozesse
en: Dust collecting machines for chemical processing

source: Elektrische Pfeffermühlen
en: Electric pepper mills

source: Elektrische Salzmühlen
en: Electric salt mills

source: Filtriermaschinen für die chemische Verarbeitung
en: Filtering machines for chemical processing

source: Maschinen zur Herstellung von Glaswaren
en: Glassware manufacturing machines

source: Magnetzündungen für Motoren
en: Ignition magnetos for engines

source: Vorrichtungen zum Einfärben von Druckstöcken
en: Inking apparatus for printing blocks

source: Formmaschinen für Holzpantinen im japanischen Stil [Geta]
en: Japanese style wooden clogs [Geta] shaping machines

source: Kerosinmotoren, nicht für Landfahrzeuge
en: Kerosene engines, not for land vehicles

source: Maschinen zum Zerkleinern von Strassenbelagsmaterial
en: Machine tools for breaking up road surface material

source: Homogenisiermaschinen für Milch
en: Milk homogenizing machines

source: Pressen für die chemische Verarbeitung
en: Presses for chemical processing

source: Hebemaschinen zur Behandlung von Textilien
en: Raising machines for textile treating

source: Raketentriebwerke, nicht für Landfahrzeuge
en: Rocket engines not for land vehicles

source: Dampfreiniger für Haushaltszwecke
en: Steam cleaners for household purposes

source: Absorptionsmaschinen für die chemische Verarbeitung
en: Absorbing machines for chemical processing

source: Reifenabzieh- und Reifenmontagemaschinen
en: Automatic tire removing and installing devices

source: Verschlußmaschinen Nahrungsmittel- und Getränkeflaschen
en: Bottle capping machines for food and beverages

source: Filterpressen für die chemische Verarbeitung
en: Filter presses for chemical processing

source: Maschinen für die Gummiverarbeitung
en: Rubber manufacturing machines

source: Maschinen zur Herstellung von Schuhen
en: Sewing machines for household purposes

source: Maschinen zur Herstellung von Flüssigkristallanzeigegeräten
en: Manufacturing machines for liquid crystal display devices

source: Vakuumpumpen [Maschinen]
en: Vacuum pumps [machines]

source: Kolben [Maschinen- oder Motorenteile]
en: Pistons [parts of machines or engines]

source: Pumpen [Maschinen]
en: Pumps [machines]

source: Bandförderer
en: Belt conveyors

source: Gasbetriebene Schweißapparate
en: Soldering apparatus, gas-operated
